# 脚本属性----------------------------------------------------------------------

# 数据分析项目：个人网络贷款数据
# 组员：黄一鸣、潘演乐、周婧
# 流程：导入数据->数据准备、探索和清理->拟合一个统计模型->在数据上评估模型预测效果->生成报告


# 导入包------------------------------------------------------------------------



source("packagesM.R")





# 修改工作路径------------------------------------------------------------------


#setwd("c:/Users/64993/Desktop/bigdata finace") # windows系统
#setwd("~/Desktop/bigdata finace") # macos系统





# 数据清洗----------------------------------------------------------------------


source("dataclean.R")





# 初始化相关设置----------------------------------------------------------------



source("SetR.R")




# 描述性统计--------------------------------------------------------------------

source("DescribeData.R")




# 数据分析和数据挖掘------------------------------------------------------------

source("dataAnalysis.R")









